import images from './assets/images';
import { selectStrategy } from './services/CoinStrategy';

let getPage = selectStrategy();
	export const gameData = [
		{ 
			id: '1', 
			textContent: [ 
				'Дуже спекотно і Ви відчуваєте спрагу. Відкриваєте очі і... перша думка: "Де я???" Узбережжя, океан, пальми.. Це якийсь острів', 
				'Хочу їсти та пити , навкруги нікого',
				`що робити?`,
			], 
			image: images.screen_1,    
			answers: [ 
				{ 
					text: 'Закрию очі та сподіватимусь, що цей кошмарний сон скоро скінчиться', 
					nextPageId: '14'
				}, 
				{ 
					text: 'Голосно волатиму про допомогу', 
					nextPageId: '2',      
				}, 
				{  
					text: 'Піду шукати Їжу', 
					nextPageId: '6',      
				} 
			] 
		},{ 
			id: '2', 
			textContent: [ 'Стая хижаків, почувши Ваші крики, прибігла поласувати свіжиною.', 
				'Ви бачите, що до вас наближаються щонайменше 3 тигри.', 'Ваші дії?.', 
			], 
			image: images.screen_2,      
			answers: [ 
			{ text: 'Озирнувшись навкруги Ви бачите, старий перевернутий човен з невеликою діркою в дні. Може сховатися під човном?', 
				nextPageId: '3'
			},{ 
				text: 'До найближчої пальми приблизно три метри, залізти на пальму?',        
				nextPageId: '4' 
			},{ 
				text: 'Стрибнути в океан і сподіватися, що зможу відплити на безпечну відстань.',   
				nextPageId: '5' 
			} ] 
		},{ 
			id: '3',    
			image: images.screen_3, 
			textContent: [
				'Ви сховались під човном', 'Тигри наблизились до Вас. Серце колотало, перед очіма пролетіло все життя. Невже це кінець?', 
				'Ви почали молитися, вболівая на Божу допомогу, хоча раніше вважали себе атеістом..', 'Раптом пролунав якийсь шурхіт збоку джунглів й хижаки побігли туди.', 
				'Фух, цього разу пощастило',
				],     
			nextPageId: '6' 
		},{
			id: '4', 
			image: images.screen_4,    
			textContent: [ 'Два великих стрибки і Ви вже на пальмі, вправно хапаясь за верхівку, спостерігаєте за хижаками.',  
				' Здається, що ненависні заняття спортом, кожного ранку, можуть допомогти врятувати життя', 'Тигри ледаче походжали під пальмою', 
				'Спекотно, мучає спрага.', 'Ви вже чітко уявляєте, як колись через декілька років хтось знайде Ваш скелет, міцно обійнявшим пальму',  
				'Раптом пролунав якийсь шурхіт збоку джунглів й хижаки побігли туди.', 'Фух, цього разу пощастило'], 
			nextPageId: '6'  
		},{ 
			id: '5',    
			image: images.screen_5, 
			nextPageId: '13',     
			textContent: [ 
				[`Вас з'їли хижаки`], 
			] 
		},{ 
			id: '6', 
			image: images.screen_6, 
			textContent: [
				'Ви йдете в сторону джунглів, коліна ще підкошуються від страху. Треба знайти питну воду та щось поїсти.', 
				'О, кокос!', 'Прямуючи до пальми з кокосом, Ви чуєте голоси', 'Зазирнувши за ліани Ви побачили аборігенів. Що робити?' 
			],       
			answers: [       
			{ 
				text: 'Підійду до них і проситиму про допомогу.',         
				nextPageId: '7' 
			},{ 
				text: 'Спостерігатиму за ними, потім спробую вкрасти їжи.',         
				nextPageId: '8' 
			},{ 
				text: 'Піду звідти якнайдалі.',         
				nextPageId: '9' 
			}, 
		]     
		},{   
			id: '7', 
			image: images.screen_7,          
			textContent: [
				'Побачивши Вас, червоношкірі зраділи, тепер вони зможуть вчасно принести жертву своїм Богам і рік буде урожайним', 
				"На заході сонця скальп буде знятий з Вашої голови, а на світанку чаша вівтаря буде наповнена Вашою кров'ю", 
				],
			nextPageId: '13',
		},{ 
			id: '8',     
			image: images.screen_8, 
			textContent: [       
				'З наступом темряви Ви підкрались до вогнища. Біля багаття були якісь запечені овочі. Шкірою спини Ви відчули якийсь рух позаду.',  
				'Повільно повертаючись Ви бачите місцевого хлопця, років 14. Натягнуто посміхаєтесь, намагаючись надати своєму обличчю дружнього виразу.', 
				' Жестами пояснюєте, що зголодніли', 'Хлопець бере посуд біля багаття з чимось смаженим і пропонує їжу'  
				], 
			answers: [       
      		{ 
				text: 'Взяти їжу.',         
				nextPageId: '10' 
			},{ 
				text: 'Біжати якнайдалі.',         
				nextPageId: '11',         
				}   
		]},{ 
			id: '9', 
			image: images.screen_9,       
			textContent: [ 
				'Ви тихенько повернулись, прямуючи в протилежному напрямку', 
				'Побачили бананову пальму, яка вдача!', 
				'зриваєте банан, їсте...', 
				'хтось поклав руку Вам на плече, переборюючи страх Ви повертаєте голову... о ні, це змія',  
				'Відчуття печіння, раптова темрява...', 
				], 
			nextPageId: '13'     
		},{ 
			id: '10', 
			image: images.screen_10,      
			textContent: [ 
				'Ви взяли їжу, роздивляєтесь, фу... це якісь смажені хробаки. Чи це добрий знак? Може вони не канібали та не вб\'ють його', 
				'Доведеться їсти', 'З\'ївши, Ви намагаєтесь пояснити хлопчині, що впали з неба і Вам треба повернутись назад через океан,', 
				'що Вам потрібен човен. Якщо аборігени Вам допоможуть, то Ви дасте їм багато їжи, бо у Вашому світі, Ви заможна людина...', 
				'Хлопчина не розуміє, що робити...залишається сподіватись на долю',  
				'Ви вирішуєте підкинути монетку, якщо "ОРЕЛ", то намагаїтесь піти, якщо "РЕШКА", то знову намагаєтесь пояснити, що потрібен човен', 
				],
			answers: [       
				{ 
					text: 'Підкинути монетку' ,         
					nextPageId: getPage, 
				},
			]
		},{ 
			id: '11',  
			image: images.screen_11,           
			textContent: [ 
				'Ви побігли і раптом відчули потужний удар в спину, нестерпне печінняі падаючи побачили наконечник списа в грудях, ', 
				'що пройшов наскрізь через все тіло. Бігти було помилкою', 
				],
			nextPageId: '14',     
		},{ 
			id: '12', 
			image: images.screen_12,      
			textContent: [ 
				'"РЕШКА"', 
				'Якось жестами та знаками вдалось вмовити хлопчину піти на узбережжя, де Ви показали на човен і пояснили,', 
				'що човен треба полагодити. Вже світало. Хлопець повернувся до свого табору, а Ви лягли спати...' 
				], 
			nextPageId: '13'   
		},{ 
			id: '13', 
			image: images.screen_13,       
			textContent: [ 
				'Ви відчуваєте головний біль, відкриваєте очі... Білі стіни, поряд з ліжком дівчина в білому халаті, мабуть медсестра. Так це лікарня.', 
				'Дівчина привітно посміхається і каже: "Не хвилюйтесь, все добре. Обстеження показало, що значних пошкодженнь немає. Два - три дні й ми Вас відпустимо додому."', 
				'Тобто острів мені наснився?' 
				], 
			answers: [       
			{ 
				text: 'Почати гру знову.',         
				nextPageId: '1' 
			},
			]
		},{
			id: '14',
			image: images.screen_14,          
			textContent: [`Під час сну Вас з'їли хижаки.`],
			answers: [       
				{ 
					text: 'Почати гру знову.',         
					nextPageId: '1' 
				},
			]
		},{ 
			id: '15', 
			image: images.screen_12,      
			textContent: [ 
				'"ОРЕЛ"', 
				'Якось жестами та знаками вдалось вмовити хлопчину піти на узбережжя, де Ви показали на човен і пояснили,', 
				'що човен треба полагодити. Вже світало. Хлопець повернувся до свого табору, а Ви лягли спати...' 
				], 
			nextPageId: '13'   
		},
	]

 
